app/controllers/gists_controller.rb

SELECT "gists".* FROM "gists" WHERE ((user_id = 1 OR status = 'public') AND description LIKE '%test%') LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "gists" WHERE (user_id = 1 OR status = 'public')
---
  def index
    @gists = Gist.paginate(:page => params[:page]).search(params[:search])

INSERT INTO "gists" ("created_at", "description", "lang", "snippet", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Tue, 13 May 2014 20:34:52 UTC +00:00], ["description", "test2"], ["lang", "java"], ["snippet", "dasdsa"], ["updated_at", Tue, 13 May 2014 20:34:52 UTC +00:00], ["user_id", 1]]
---
  def create
    @gist = Gist.new(gist_params)

    respond_to do |format|
      if @gist.save

UPDATE "gists" SET "snippet" = ?, "updated_at" = ? WHERE "gists"."id" = 4  [["snippet", "public Form1()\r\n{\r\n       InitializeComponent();\r\n}"], ["updated_at", Tue, 25 Mar 2014 23:44:52 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @gist.update(gist_params)

DELETE FROM "gists" WHERE "gists"."id" = ?  [["id", 1]]
---
  def destroy
    @gist.destroy

SELECT "gists".* FROM "gists" WHERE "gists"."id" = ? LIMIT 1  [["id", "5"]]
---
    def set_gist
      @gist = Gist.find(params[:id])